[{"headline": [], "date": "2014-04-01", "content": []},
{"headline": ["Britain to investigate Muslim Brotherhood"], "date": "2014-04-01", "content": ["\r\n                        Prime Minister David Cameron orders probe of group's activities in UK, citing its \"alleged links to violent extremism\".\r\n                    "]},
{"headline": ["Russia pulls some troops from Ukraine border", " "], "date": "2014-04-01", "content": ["\r\n                        Defence Ministry announces withdrawal of one battalion, a day after US and Russia held talks in Paris.\r\n                    "]},
{"headline": ["France gets new PM following election losses"], "date": "2014-04-01", "content": ["\r\n                        The Socialist party suffered heavy losses in municipal elections on Sunday, prompting the appointment of Manuel Valls.\r\n                    "]},
{"headline": ["Turkish PM claims landslide election win", " "], "date": "2014-04-01", "content": ["\r\n                        Erdogan's AKP gets more than 45 percent of votes in local polls seen as a vote of confidence amid graft allegations.\r\n                    "]},
{"headline": [], "date": "2014-04-01", "content": []},
{"headline": ["Syrian army retakes key post in Latakia"], "date": "2014-04-01", "content": ["\r\n                        Syrian state television says government troops have captured a key position in Latakia seized last week by rebels.\r\n                    "]},
{"headline": ["Egypt court denies bail to Al Jazeera staff", " "], "date": "2014-04-01", "content": ["\r\n                        Cairo court adjourns trial a fourth time for three journalists, as they approach 100 days since their arrest.\r\n                    "]},
{"headline": [], "date": "2014-04-01", "content": []},
{"headline": ["US ambassador to India resigns"], "date": "2014-04-01", "content": ["\r\n                        Nancy Powell to retire after helping to mend US-India ties following the arrest of an Indian diplomat in New York.\r\n                    "]},
{"headline": ["Living with fire in India's Jharia"], "date": "2014-04-01", "content": ["\r\n                        About 700,000 people in eastern Jharkhand state live amid fires triggered by mining of coal from the surface.\r\n                    "]},
{"headline": [], "date": "2014-04-01", "content": []},
{"headline": ["Uganda president leads anti-gay rally"], "date": "2014-04-01", "content": ["\r\n                        Yoweri Museveni tells supporters his country can live without aid that donors suspended in protest at controversial law.\r\n                    "]},
{"headline": ["MSF: Guinea Ebola outbreak unprecedented", " "], "date": "2014-04-01", "content": ["\r\n                        Aid agency says Zaire strain of Ebola virus most aggressive and deadly, killing nine out of 10 patients.\r\n                    "]},
{"headline": [], "date": "2014-04-01", "content": []},
{"headline": ["Mexico vigilante leader accused of murder"], "date": "2014-04-01", "content": ["\r\n                        Enrique Hernandez Salcedo has been arrested for allegedly ordering the March 22 murder of Mayor Gustavo Garibay. \r\n                    "]},
{"headline": ["Jamaican police officers charged with murder"], "date": "2014-04-01", "content": ["\r\n                        Investigators say officers from Clarendon parish were involved in unlawful killing of civilians.\r\n                    "]},
{"headline": ["French socialists hit hard in local elections"], "date": "2014-04-01", "content": ["\r\n                        Early results show far-right National Front taking control of 14 towns as voters shun left-wing President Hollande.\r\n                    "]},
{"headline": ["Russia presses call for federal Ukraine", " "], "date": "2014-04-01", "content": ["\r\n                        US-Russia talks fail to end crisis, with Russia presenting vision of Ukraine's future while US calls for troop pullback.\r\n                    "]},
{"headline": ["Lufthansa cancels 3,800 flights due to strike"], "date": "2014-04-01", "content": ["\r\n                        Airline to lose out on tens of millions of euros as pilots plan three-day strike over cut in early retirement contract.\r\n                    "]},
{"headline": ["Turkey accused of sending fighters to Syria"], "date": "2014-04-01", "content": ["\r\n                        Damascus says Ankara sends foreign fighters to Syria to fight government troops.\r\n                    "]},
{"headline": ["Israel offers Palestinians new talks proposal"], "date": "2014-04-01", "content": ["\r\n                        The move aims to prevent collapse of peace process, after Tel Aviv failed to free 26 Palestinian prisoners.\r\n                    "]},
{"headline": ["Sisi mocked in Egypt internet campaign"], "date": "2014-04-01", "content": ["\r\n                        Presidential hopeful subject of sarcastic 'vote for the pimp' movement on social media, leading to calls for a ban.\r\n                    "]},
{"headline": ["'Thankful' Sri Lanka to free Indian fishermen"], "date": "2014-04-01", "content": ["\r\n                        President Rajapaksa orders release of fishermen detained for poaching to thank India for abstaining from UN rights vote.\r\n                    "]},
{"headline": ["Afghans register for polls despite attacks"], "date": "2014-04-01", "content": ["\r\n                        Voters remain defiant and rush to register for Saturday's election despite numerous recent Taliban attacks.\r\n                    "]},
{"headline": ["UN warns of climate change risks"], "date": "2014-04-01", "content": ["\r\n                        The effects of global warming could spiral 'out of control' if the world does not cut pollution, new UN report says.\r\n                    "]},
{"headline": ["Liberia confirms Ebola's arrival from Guinea"], "date": "2014-04-01", "content": ["\r\n                        Government says patient dies after catching disease in Guinea, where 70 have died in one of worst outbreaks for years.\r\n                    "]},
{"headline": ["Nigerian prisoners killed in Abuja jailbreak"], "date": "2014-04-01", "content": ["\r\n                        At least 21 detainees shot dead during attempted escape from the cells of the secret police headquarters in Abuja.\r\n                    "]},
{"headline": ["Rio police storm favela in dawn operation", " "], "date": "2014-04-01", "content": ["\r\n                        More than 1,000 police backed by military and armoured vehicles occupy vast favela near Rio de Janeiro's airport.\r\n                    "]},
{"headline": ["Venezuela troops take back protest-torn city", " "], "date": "2014-04-01", "content": ["\r\n                        Army and police dismantle barricades in San Cristobal following operation to drive out anti-government protesters.\r\n                    "]},
{"headline": ["US officials cut number missing in landslide"], "date": "2014-04-01", "content": ["\r\n                        Number of people presumed missing after Washington state disaster drops from 90 to 30 after many are confirmed alive.\r\n                    "]},
{"headline": [], "date": "2014-04-01", "content": []},
{"headline": ["UN court rules against Japan whaling", " "], "date": "2014-04-01", "content": ["\r\n                        International Court of Justice rules whale hunting is not for scientific purposes, and orders Tokyo to revoke permits.\r\n                    "]},
{"headline": ["Spanish journalists home after Syria ordeal"], "date": "2014-04-01", "content": ["\r\n                        Javier Espinosa and Ricardo Garcia Vilanova were greeted by family in Madrid after six months in captivity in Syria.\r\n                    "]},
{"headline": ["Slovakia elects political novice as president"], "date": "2014-04-01", "content": ["\r\n                        Andrej Kiska, a millionaire philanthropist, trounces current PM, Robert Fico, in run-off vote for the presidency.\r\n                    "]},
{"headline": ["Syria leak prompts espionage probe in Turkey"], "date": "2014-04-01", "content": ["\r\n                        Embroiled in political turmoil, Turkey's leader vows to pursue his adversaries in the run-up to Sunday's elections.\r\n                    "]},
{"headline": ["Israeli ex-PM Olmert convicted of corruption", " "], "date": "2014-04-01", "content": ["\r\n                        Tel Aviv district court finds former prime minister Ehud Olmert guilty of corruption linked to property development.\r\n                    "]},
{"headline": ["Spanish journalists home after Syria ordeal"], "date": "2014-04-01", "content": ["\r\n                        Javier Espinosa and Ricardo Garcia Vilanova were greeted by family in Madrid after six months in captivity in Syria.\r\n                    "]},
{"headline": [" Egypt presidential poll set for late May", " "], "date": "2014-04-01", "content": ["\r\n                        Field Marshal Abdel Fattah el-Sisi widely expected to win the election in the first round,  to be held on May 26 and 27.\r\n                    "]},
{"headline": ["Italy seeks US help for marines held in India"], "date": "2014-04-01", "content": ["\r\n                        Prime minister calls for international efforts to resolve case involving two marines accused of killing two fishermen.\r\n                    "]},
{"headline": ["Chadian troops shoot dead civilians in CAR"], "date": "2014-04-01", "content": ["\r\n                        Authorities are trying to find out what led Chadian troops to shoot and kill at least 24 civilians in the capital.\r\n                    "]},
{"headline": ["Ebola scare forces Senegal to close borders"], "date": "2014-04-01", "content": ["\r\n                        Guinea records more cases and deaths, as Senegal shuts crossings amid reports of cases in other neighbouring states.\r\n                    "]},
{"headline": ["Cuba passes law to attract foreign investors", " "], "date": "2014-04-01", "content": ["\r\n                        New law aims to make the island nation more attractive to foreign investment as economy struggles to improve.\r\n                    "]},
{"headline": ["Mexico finds abandoned immigrant children"], "date": "2014-04-01", "content": ["\r\n                        Hundreds of children, mainly from Central America, found across Mexico after traffickers pledged to take them to the US.\r\n                    "]},
{"headline": ["Earthquake rattles Los Angeles"], "date": "2014-04-01", "content": ["\r\n                        Magnitude-5.1 quake strikes Los Angeles and surrounding counties, causing rockslide and at least five aftershocks.\r\n                    "]},
{"headline": ["UN warns of climate change risks"], "date": "2014-04-01", "content": ["\r\n                        The effects of global warming could spiral 'out of control' if the world does not cut pollution, new UN report says.\r\n                    "]},
{"headline": ["Rival Koreas trade fire across sea border", " "], "date": "2014-04-01", "content": ["\r\n                        Washington and Moscow express concern about fresh tensions on the Korean peninsula after firing of shells.\r\n                    "]},
{"headline": ["Fiji travel ban lifted on promise of election"], "date": "2014-04-01", "content": ["\r\n                        Australia and NZ lift restrictions eight years after coup by Frank Bainimarama following his announcement of elections.\r\n                    "]},
{"headline": ["Deaths in attack on Iraq police patrol"], "date": "2014-04-01", "content": ["\r\n                        Eight people killed, including a mother and three children, in Baghdad attack, one of several to take place on Sunday.\r\n                    "]},
{"headline": ["Deaths in Iraq shooting and suicide attacks"], "date": "2014-04-01", "content": ["\r\n                        Soldiers and civilians attacked by gunfire and a suicide car bombing in Sunni-majority areas a month before elections.\r\n                    "]},
{"headline": ["UN general assembly calls Crimea vote illegal", " "], "date": "2014-04-01", "content": ["\r\n                        One hundred nations declare Crimea referendum illegal, with 11 against and 58 abstaining in largely symbolic resolution.\r\n                    "]},
{"headline": ["US car company recalls millions of vehicles"], "date": "2014-04-01", "content": ["\r\n                        GM extends global recall to 2.1m cars over a potentially deadly ignition fault that can cut engines at high speed.\r\n                    "]},
{"headline": ["Giant hailstones batter Hong Kong"], "date": "2014-04-01", "content": ["\r\n                        Hailstones smash windows at a shopping mall as observatory records nearly 9,000 lighting strikes in one hour.\r\n                    "]},
{"headline": ["Thousands of Taiwanese protest China pact", " "], "date": "2014-04-01", "content": ["\r\n                        Tens of thousands take to streets of Taipei to pressure president to retract controversial trade agreement with China.\r\n                    "]},
{"headline": ["Thais vote for senators as PM showdown looms"], "date": "2014-04-01", "content": ["\r\n                        Outcome of upper house ballot could influence decision to remove prime minister which requires three-fifths vote.\r\n                    "]},
{"headline": ["Tensions rise as Myanmar holds census", " "], "date": "2014-04-01", "content": ["\r\n                        Buddhist nationalists threaten to boycott tally over fears it could lead to recognition for Rohingyas.\r\n                    "]},
{"headline": ["China seizes $14.5bn of ex-official assets", " "], "date": "2014-04-01", "content": ["\r\n                        Illegal assets were seized from family members and associates of retired domestic security chief Zhou Yongkang.\r\n                    "]},
{"headline": ["Climate change 'complicates' global security"], "date": "2014-04-01", "content": ["\r\n                        Top scientists say climate change will complicate and worsen global security problems such as wars and refugees.\r\n                    "]}]